MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA4C1BB3CFM/mcu.h
        struct
        {
            __IOM uint16_t IWDTRF : 1; /*!< [0..0] Independent Watchdog Timer Reset Detect FlagNOTE: Writable
                                        *   only to clear the flag. Confirm the value is 1 and then
                                        *   write 0.                                                                  */
            __IOM uint16_t WDTRF : 1;  /*!< [1..1] Watchdog Timer Reset Detect FlagNOTE: Writable only to
                                        *   clear the flag. Confirm the value is 1 and then write 0.                  */
            __IOM uint16_t SWRF : 1;   /*!< [2..2] Software Reset Detect FlagNOTE: Writable only to clear
                                        *   the flag. Confirm the value is 1 and then write 0.                        */
            uint16_t             : 5;
            __IOM uint16_t RPERF : 1;  /*!< [8..8] RAM Parity Error Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            __IOM uint16_t REERF : 1;  /*!< [9..9] RAM ECC Error Reset Detect FlagNOTE: Writable only to
                                        *   clear the flag. Confirm the value is 1 and then write 0.                  */
            uint16_t              : 1;
            __IOM uint16_t BUSMRF : 1; /*!< [11..11] Bus Master MPU Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            uint16_t             : 1;
            __IOM uint16_t TZERF : 1;  /*!< [13..13] Trust Zone Error Reset Detect Flag                               */
            uint16_t             : 1;
            __IOM uint16_t CPERF : 1;  /*!< [15..15] Cache Parity Error Reset Detect Flag                             */
        } RSTSR1_b;
    };
    __IM uint16_t RESERVED45;
    __IM uint32_t RESERVED46[3];

    union
    {
        __IOM uint8_t USBCKCR_ALT;       /*!< (@ 0x000000D0) USB Clock Control Register                                 */

        struct
        {
            __IOM uint8_t USBCLKSEL : 1; /*!< [0..0] The USBCLKSEL bit selects the source of the USB clock
                                          *   (UCLK).                                                                   */
            uint8_t : 7;
        } USBCKCR_ALT_b;
    };
    __IM uint8_t  RESERVED47;
    __IM uint16_t RESERVED48;
    __IM uint32_t RESERVED49[3];

    union
    {
        __IOM uint8_t LVD1CR1;         /*!< (@ 0x000000E0) Voltage Monitor 1 Circuit Control Register 1               */

        struct
        {
            __IOM uint8_t IDTSEL : 2;  /*!< [1..0] Voltage Monitor Interrupt Generation Condition Select              */
            __IOM uint8_t IRQSEL : 1;  /*!< [2..2] Voltage Monitor Interrupt Type Select                              */
            uint8_t              : 5;
        } LVD1CR1_b;
    };

    union
    {
        __IOM uint8_t LVD1SR;          /*!< (@ 0x000000E1) Voltage Monitor 1 Circuit Status Register                  */

        struct
        {
            __IOM uint8_t DET : 1;     /*!< [0..0] Voltage Monitor Voltage Change Detection Flag NOTE: Only
                                        *   0 can be written to this bit. After writing 0 to this bit,
                                        *   it takes 2 system clock cycles for the bit to be read as
                                        *   0.                                                                        */
            __IM uint8_t MON : 1;      /*!< [1..1] Voltage Monitor 1 Signal Monitor Flag                              */
            uint8_t          : 6;
        } LVD1SR_b;
    };

    union
    {
        __IOM uint8_t LVD2CR1;         /*!< (@ 0x000000E2) Voltage Monitor 2 Circuit Control Register 1               */

        struct
        {
            __IOM uint8_t IDTSEL : 2;  /*!< [1..0] Voltage Monitor Interrupt Generation Condition Select              */
            __IOM uint8_t IRQSEL : 1;  /*!< [2..2] Voltage Monitor Interrupt Type Select                              */
            uint8_t              : 5;
        } LVD2CR1_b;
    };

    union
    {
        __IOM uint8_t LVD2SR;          /*!< (@ 0x000000E3) Voltage Monitor 2 Circuit Status Register                  */

        struct
        {
            __IOM uint8_t DET : 1;     /*!< [0..0] Voltage Monitor Voltage Change Detection Flag NOTE: Only
                                        *   0 can be written to this bit. After writing 0 to this bit,
                                        *   it takes 2 system clock cycles for the bit to be read as
                                        *   0.                                                                        */
            __IM uint8_t MON : 1;      /*!< [1..1] Voltage Monitor 1 Signal Monitor Flag                              */
            uint8_t          : 6;
        } LVD2SR_b;
    };
    __IM uint32_t RESERVED50[3];

    union
    {
        __IOM uint8_t SRMPSCR;         /*!< (@ 0x000000F0) SRAM Power State Control Register                          */

        struct
        {
            __IOM uint8_t SPSC0 : 1;   /*!< [0..0] SRAM Power State Control                                           */
            __IOM uint8_t SPSC1 : 1;   /*!< [1..1] SRAM Power State Control                                           */
            __IOM uint8_t SPSC2 : 1;   /*!< [2..2] SRAM Power State Control                                           */
            __IOM uint8_t SPSC3 : 1;   /*!< [3..3] SRAM Power State Control                                           */
            __IOM uint8_t SPSC4 : 1;   /*!< [4..4] SRAM Power State Control                                           */
            __IOM uint8_t SPSC5 : 1;   /*!< [5..5] SRAM Power State Control                                           */
            uint8_t             : 2;
        } SRMPSCR_b;
    };
    __IM uint8_t  RESERVED51;
    __IM uint16_t RESERVED52;
    __IM uint32_t RESERVED53[179];

    union
    {
        __IOM uint32_t CGFSAR;           /*!< (@ 0x000003C0) Clock Generation Function Security Attribute
                                          *                  Register                                                   */

        struct
        {
            __IOM uint32_t NONSEC00 : 1; /*!< [0..0] Non Secure Attribute bit 00                                        */
            uint32_t                : 1;
            __IOM uint32_t NONSEC02 : 1; /*!< [2..2] Non Secure Attribute bit 02                                        */
            __IOM uint32_t NONSEC03 : 1; /*!< [3..3] Non Secure Attribute bit 03                                        */
            __IOM uint32_t NONSEC04 : 1; /*!< [4..4] Non Secure Attribute bit 04                                        */
            __IOM uint32_t NONSEC05 : 1; /*!< [5..5] Non Secure Attribute bit 05                                        */
            __IOM uint32_t NONSEC06 : 1; /*!< [6..6] Non Secure Attribute bit 06                                        */
            __IOM uint32_t NONSEC07 : 1; /*!< [7..7] Non Secure Attribute bit 07                                        */
            __IOM uint32_t NONSEC08 : 1; /*!< [8..8] Non Secure Attribute bit 08                                        */
            uint32_t                : 2;
            __IOM uint32_t NONSEC11 : 1; /*!< [11..11] Non Secure Attribute bit 11                                      */
            uint32_t                : 4;
            __IOM uint32_t NONSEC16 : 1; /*!< [16..16] Non Secure Attribute bit 16                                      */
            uint32_t                : 1;
            __IOM uint32_t NONSEC18 : 1; /*!< [18..18] Non Secure Attribute bit 18                                      */
            uint32_t                : 1;
            __IOM uint32_t NONSEC20 : 1; /*!< [20..20] Non Secure Attribute bit 20                                      */
            uint32_t                : 5;
            __IOM uint32_t NONSEC26 : 1; /*!< [26..26] Non Secure Attribute bit 26                                      */
            __IOM uint32_t NONSEC27 : 1; /*!< [27..27] Non Secure Attribute bit 27                                      */
            uint32_t                : 4;
        } CGFSAR_b;
    };

    union
    {
        __IOM uint32_t RSTSAR;          /*!< (@ 0x000003C4) Reset Security Attribution Register                        */

        struct
        {
            __IOM uint32_t NONSEC0 : 1; /*!< [0..0] Non Secure Attribute bit 0                                         */
            __IOM uint32_t NONSEC1 : 1; /*!< [1..1] Non Secure Attribute bit 1                                         */
            __IOM uint32_t NONSEC2 : 1; /*!< [2..2] Non Secure Attribute bit 2                                         */
            uint32_t               : 29;
        } RSTSAR_b;
    };

    union
    {
        __IOM uint32_t LPMSAR;          /*!< (@ 0x000003C8) Low Power Mode Security Attribution Register               */

        struct
        {
            __IOM uint32_t NONSEC0 : 1; /*!< [0..0] Non Secure Attribute bit 0                                         */
            uint32_t               : 1;
            __IOM uint32_t NONSEC2 : 1; /*!< [2..2] Non Secure Attribute bit 2                                         */
            uint32_t               : 1;
            __IOM uint32_t NONSEC4 : 1; /*!< [4..4] Non Secure Attribute bit 4                                         */
            uint32_t               : 27;
        } LPMSAR_b;
    };

    union
    {
        __IOM uint32_t LVDSAR;           /*!< (@ 0x000003CC) Low Voltage Detection Security Attribution Register        */

        struct
        {
            __IOM uint32_t NONSEC0  : 1; /*!< [0..0] Non Secure Attribute bit 0                                         */
            __IOM uint32_t NONSEC1  : 1; /*!< [1..1] Non Secure Attribute bit 1                                         */
            uint32_t                : 6;
            __IOM uint32_t NONSEC8  : 1; /*!< [8..8] Non Secure Attribute bit 8                                         */
            __IOM uint32_t NONSEC9  : 1; /*!< [9..9] Non Secure Attribute bit 9                                         */
            __IOM uint32_t NONSEC10 : 1; /*!< [10..10] Non Secure Attribute bit 10                                      */
            uint32_t                : 21;
        } LVDSAR_b;
    };
    __IM uint32_t RESERVED54[11];
    __IM uint16_t RESERVED55;

    union
    {
        __IOM uint16_t PRCR;           /*!< (@ 0x000003FE) Protect Register                                           */

        struct
        {
            __IOM uint16_t PRC0 : 1;   /*!< [0..0] Enables writing to the registers related to the clock
                                        *   generation circuit.                                                       */
            __IOM uint16_t PRC1 : 1;   /*!< [1..1] Enables writing to the registers related to the operating
                                        *   modes, the low power consumption modes and the battery
                                        *   backup function.                                                          */
            uint16_t            : 1;
            __IOM uint16_t PRC3 : 1;   /*!< [3..3] Enables writing to the registers related to the LVD.               */
            __IOM uint16_t PRC4 : 1;   /*!< [4..4] PRC4                                                               */
            uint16_t            : 3;
            __OM uint16_t PRKEY : 8;   /*!< [15..8] PRKEY Key Code                                                    */
        } PRCR_b;
    };
    __IM uint32_t RESERVED56[3];
    __IM uint16_t RESERVED57;

    union
    {
        __IOM uint8_t SYOCDCR;         /*!< (@ 0x0000040E) System Control OCD Control Register                        */

        struct
        {
            uint8_t             : 7;
            __IOM uint8_t DBGEN : 1;   /*!< [7..7] Debugger Enable bit                                                */
        } SYOCDCR_b;
    };
    __IM uint8_t RESERVED58;

    union
    {
        __IOM uint8_t RSTSR0;          /*!< (@ 0x00000410) Reset Status Register 0                                    */

        struct
        {
            __IOM uint8_t PORF : 1;    /*!< [0..0] Power-On Reset Detect FlagNOTE: Writable only to clear
                                        *   the flag. Confirm the value is 1 and then write 0.                        */
            __IOM uint8_t LVD0RF : 1;  /*!< [1..1] Voltage Monitor 0 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            __IOM uint8_t LVD1RF : 1;  /*!< [2..2] Voltage Monitor 1 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            __IOM uint8_t LVD2RF : 1;  /*!< [3..3] Voltage Monitor 2 Reset Detect FlagNOTE: Writable only
                                        *   to clear the flag. Confirm the value is 1 and then write
                                        *   0.                                                                        */
            uint8_t : 4;
        } RSTSR0_b;
    };

    union
    {
        __IOM uint8_t RSTSR2;          /*!< (@ 0x00000411) Reset Status Register 2                                    */

        struct
        {
            __IOM uint8_t CWSF : 1;    /*!< [0..0] Cold/Warm Start Determination Flag                                 */
            uint8_t            : 7;
        } RSTSR2_b;
    };
    __IM uint8_t RESERVED59;

    union
    {
        __IOM uint8_t MOMCR;           /*!< (@ 0x00000413) Main Clock Oscillator Mode Oscillation Control
                                        *                  Register                                                   */

        struct
        {
            uint8_t              : 3;
            __IOM uint8_t MODRV1 : 1;  /*!< [3..3] Main Clock Oscillator Drive Capability 1 Switching                 */
            uint8_t              : 2;
            __IOM uint8_t MOSEL  : 1;  /*!< [6..6] Main Clock Oscillator Switching                                    */
            uint8_t              : 1;
        } MOMCR_b;
    };
    __IM uint16_t RESERVED60;
    __IM uint8_t  RESERVED61;

    union
    {
        union
        {
            __IOM uint8_t LVCMPCR;     /*!< (@ 0x00000417) Voltage Monitor Circuit Control Register                   */

            struct
            {
                uint8_t             : 5;
                __IOM uint8_t LVD1E : 1; /*!< [5..5] Voltage Detection 1 Enable                                         */
                __IOM uint8_t LVD2E : 1; /*!< [6..6] Voltage Detection 2 Enable                                         */
                uint8_t             : 1;
            } LVCMPCR_b;
        };

        union
        {
            __IOM uint8_t LVD1CMPCR;      /*!< (@ 0x00000417) Voltage Monitoring 1 Comparator Control Register           */

            struct
            {
                __IOM uint8_t LVDLVL : 4; /*!< [3..0] Voltage Detection 1 Level Select (Standard voltage during
                                           *   drop in voltage)                                                          */
                uint8_t            : 3;
                __IOM uint8_t LVDE : 1;   /*!< [7..7] Voltage Detection 1 Enable                                         */
            } LVD1CMPCR_b;
        };
    };

    union
    {
        __IOM uint8_t LVD2CMPCR;         /*!< (@ 0x00000418) Voltage Monitoring 2 Comparator Control Register           */

        struct
        {
            __IOM uint8_t LVDLVL : 3;    /*!< [2..0] Voltage Detection 2 Level Select (Standard voltage during
                                          *   drop in voltage)                                                          */
            uint8_t                 : 3;
            __IOM uint8_t EXVCCINP2 : 1; /*!< [6..6] Voltage Detection 2 Comparison (Voltage external input
                                          *   select)                                                                   */
            __IOM uint8_t LVDE : 1;      /*!< [7..7] Voltage Detection 2 Enable                                         */
        } LVD2CMPCR_b;
    };
    __IM uint8_t RESERVED62;

    union
    {
        __IOM uint8_t LVD1CR0;         /*!< (@ 0x0000041A) Voltage Monitor 1 Circuit Control Register 0               */

        struct
        {
            __IOM uint8_t RIE  : 1;    /*!< [0..0] Voltage Monitor Interrupt/Reset Enable                             */
            uint8_t            : 1;
            __IOM uint8_t CMPE : 1;    /*!< [2..2] Voltage Monitor Circuit Comparison Result Output Enable            */
            uint8_t            : 3;
            __IOM uint8_t RI   : 1;    /*!< [6..6] Voltage Monitor Circuit Mode Select                                */
            __IOM uint8_t RN   : 1;    /*!< [7..7] Voltage Monitor Reset Negate Select                                */
        } LVD1CR0_b;
    };

    union
    {
        __IOM uint8_t LVD2CR0;         /*!< (@ 0x0000041B) Voltage Monitor 2 Circuit Control Register 0               */

        struct
        {
            __IOM uint8_t RIE  : 1;    /*!< [0..0] Voltage Monitor Interrupt/Reset Enable                             */
            uint8_t            : 1;
            __IOM uint8_t CMPE : 1;    /*!< [2..2] Voltage Monitor Circuit Comparison Result Output Enable            */
            uint8_t            : 3;
            __IOM uint8_t RI   : 1;    /*!< [6..6] Voltage Monitor Circuit Mode Select                                */
            __IOM uint8_t RN   : 1;    /*!< [7..7] Voltage Monitor Reset Negate Select                                */
        } LVD2CR0_b;
    };
    __IM uint32_t RESERVED63[25];

    union
    {
        __IOM uint8_t SOSCCR;          /*!< (@ 0x00000480) Sub-Clock Oscillator Control Register                      */

        struct
        {
            __IOM uint8_t SOSTP : 1;   /*!< [0..0] Sub-Clock Oscillator Stop                                          */
            uint8_t             : 7;
        } SOSCCR_b;
    };

    union
    {
        __IOM uint8_t SOMCR;           /*!< (@ 0x00000481) Sub Clock Oscillator Mode Control Register                 */

        struct
        {
            __IOM uint8_t SODRV  : 2;  /*!< [1..0] Sub-Clock Oscillator Drive Capability Switching                    */
            uint8_t              : 2;
            __IOM uint8_t EXCLKS : 1;  /*!< [4..4] Sub Clock Oscillator Mode Function Switching                       */
            uint8_t              : 3;
        } SOMCR_b;
    };

    union
    {
        __IOM uint8_t SOMRG;           /*!< (@ 0x00000482) Sub Clock Oscillator Margin Check Register                 */

        struct
        {
            __IOM uint8_t SOSCMRG : 2; /*!< [1..0] Sub Clock Oscillator Margin check Switching                        */
            uint8_t               : 6;
        } SOMRG_b;
    };
    __IM uint8_t  RESERVED64;
    __IM uint32_t RESERVED65[3];

    union
    {
        __IOM uint8_t LOCOCR;          /*!< (@ 0x00000490) Low-Speed On-Chip Oscillator Control Register              */

        struct
        {
            __IOM uint8_t LCSTP : 1;   /*!< [0..0] LOCO Stop                                                          */
            uint8_t             : 7;
        } LOCOCR_b;
    };
    __IM uint8_t RESERVED66;

    union
    {
        __IOM uint8_t LOCOUTCR;         /*!< (@ 0x00000492) LOCO User Trimming Control Register                        */

        struct
        {
            __IOM uint8_t LOCOUTRM : 8; /*!< [7..0] LOCO User Trimming 1000_0000 : -128 1000_0001 : -127
                                         *   1000_0010 : -126 . . . 1111_1111 : -1 0000_0000 : Center
                                         *   Code 0000_0001 : +1 . . . 0111_1101 : +125 0111_1110 :
                                         +126 0111_1111 : +127These bits are added to original LOCO
                                         *   trimming bits                                                             */
        } LOCOUTCR_b;
    };
    __IM uint8_t  RESERVED67;
    __IM uint32_t RESERVED68[11];

    union
    {
        __IOM uint8_t VBTLVDCR;        /*!< (@ 0x000004C0) EXLVDVBAT Circuit Control Register                         */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] EXLVDVBAT Pin Low Voltage Detect Enable                            */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] EXLVDVBAT Pin Low Voltage Detect Level Select                      */
        } VBTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDSR;        /*!< (@ 0x000004C1) EXLVDVBAT Circuit Status Register                          */

        struct
        {
            uint8_t           : 1;
            __IOM uint8_t DET : 1;     /*!< [1..1] EXLVDVBAT Pin Low Voltage Detect Flag                              */
            uint8_t           : 3;
            __IM uint8_t MON  : 1;     /*!< [5..5] EXLVDVBAT Pin Low Voltage Monitor Flag                             */
            uint8_t           : 2;
        } VBTLVDSR_b;
    };

    union
    {
        __IOM uint8_t VBTCMPCR;        /*!< (@ 0x000004C2) EXLVDVBAT Comparator Control Register                      */

        struct
        {
            __IOM uint8_t CMPE : 1;    /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Circuit Output Enable             */
            uint8_t            : 7;
        } VBTCMPCR_b;
    };

    union
    {
        __IOM uint8_t VBTLVDICR;       /*!< (@ 0x000004C3) EXLVDVBAT Pin Low Voltage Detect Interrupt Control
                                        *                  Register                                                   */

        struct
        {
            __IOM uint8_t IE     : 1;  /*!< [0..0] EXLVDVBAT Pin Low Voltage Detect Interrupt Enable                  */
            uint8_t              : 3;
            __IOM uint8_t IDTSEL : 2;  /*!< [5..4] EXLVDVBAT Pin Low Voltage Detect Interrupt Generation
                                        *   Condition Select                                                          */
            uint8_t : 2;
        } VBTLVDICR_b;
    };

    union
    {
        __IOM uint8_t VRTLVDCR;        /*!< (@ 0x000004C4) LVDVRTC Circuit Control Register                           */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t LVDE : 1;    /*!< [4..4] VRTC Pin Low Voltage Detect Enable                                 */
            __IOM uint8_t LVL  : 3;    /*!< [7..5] VRTC Pin Low Voltage Detect Level Select                           */
        } VRTLVDCR_b;
    };

    union
    {
        __IOM uint8_t VRTSR;           /*!< (@ 0x000004C5) VRTC Status Register                                       */

