MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA4C1BB3CFM/mcu.h
 #define R_SYSTEM_VBTLVDICR_IDTSEL_Pos           (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_VBTLVDICR_IDTSEL_Msk           (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */
/* =======================================================  VRTLVDCR  ======================================================== */
 #define R_SYSTEM_VRTLVDCR_LVDE_Pos              (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_VRTLVDCR_LVDE_Msk              (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
 #define R_SYSTEM_VRTLVDCR_LVL_Pos               (5UL)          /*!< LVL (Bit 5)                                           */
 #define R_SYSTEM_VRTLVDCR_LVL_Msk               (0xe0UL)       /*!< LVL (Bitfield-Mask: 0x07)                             */
/* =========================================================  VRTSR  ========================================================= */
 #define R_SYSTEM_VRTSR_PORDET_Pos               (0UL)          /*!< PORDET (Bit 0)                                        */
 #define R_SYSTEM_VRTSR_PORDET_Msk               (0x1UL)        /*!< PORDET (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_DET_Pos                  (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_VRTSR_DET_Msk                  (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_VRTSR_VRTVLD_Pos               (4UL)          /*!< VRTVLD (Bit 4)                                        */
 #define R_SYSTEM_VRTSR_VRTVLD_Msk               (0x10UL)       /*!< VRTVLD (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VRTSR_MON_Pos                  (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_VRTSR_MON_Msk                  (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* =======================================================  VRTCMPCR  ======================================================== */
 #define R_SYSTEM_VRTCMPCR_CMPE_Pos              (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_VRTCMPCR_CMPE_Msk              (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  VRTLVDICR  ======================================================= */
 #define R_SYSTEM_VRTLVDICR_IE_Pos               (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_VRTLVDICR_IE_Msk               (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Pos           (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_VRTLVDICR_IDTSEL_Msk           (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */
/* ========================================================  EXLVDCR  ======================================================== */
 #define R_SYSTEM_EXLVDCR_LVDE_Pos               (4UL)          /*!< LVDE (Bit 4)                                          */
 #define R_SYSTEM_EXLVDCR_LVDE_Msk               (0x10UL)       /*!< LVDE (Bitfield-Mask: 0x01)                            */
/* ========================================================  EXLVDSR  ======================================================== */
 #define R_SYSTEM_EXLVDSR_DET_Pos                (1UL)          /*!< DET (Bit 1)                                           */
 #define R_SYSTEM_EXLVDSR_DET_Msk                (0x2UL)        /*!< DET (Bitfield-Mask: 0x01)                             */
 #define R_SYSTEM_EXLVDSR_MON_Pos                (5UL)          /*!< MON (Bit 5)                                           */
 #define R_SYSTEM_EXLVDSR_MON_Msk                (0x20UL)       /*!< MON (Bitfield-Mask: 0x01)                             */
/* ======================================================  EXLVDCMPCR  ======================================================= */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Pos            (0UL)          /*!< CMPE (Bit 0)                                          */
 #define R_SYSTEM_EXLVDCMPCR_CMPE_Msk            (0x1UL)        /*!< CMPE (Bitfield-Mask: 0x01)                            */
/* =======================================================  EXLVDICR  ======================================================== */
 #define R_SYSTEM_EXLVDICR_IE_Pos                (0UL)          /*!< IE (Bit 0)                                            */
 #define R_SYSTEM_EXLVDICR_IE_Msk                (0x1UL)        /*!< IE (Bitfield-Mask: 0x01)                              */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Pos            (4UL)          /*!< IDTSEL (Bit 4)                                        */
 #define R_SYSTEM_EXLVDICR_IDTSEL_Msk            (0x30UL)       /*!< IDTSEL (Bitfield-Mask: 0x03)                          */

/* =========================================================================================================================== */
/* ================                                           R_TSN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  TSCDR  ========================================================= */
/* ========================================================  TSCDRH  ========================================================= */
 #define R_TSN_TSCDRH_TSCDRH_Pos    (0UL)      /*!< TSCDRH (Bit 0)                                        */
 #define R_TSN_TSCDRH_TSCDRH_Msk    (0xffUL)   /*!< TSCDRH (Bitfield-Mask: 0xff)                          */
/* ========================================================  TSCDRL  ========================================================= */
 #define R_TSN_TSCDRL_TSCDRL_Pos    (0UL)      /*!< TSCDRL (Bit 0)                                        */
 #define R_TSN_TSCDRL_TSCDRL_Msk    (0xffffUL) /*!< TSCDRL (Bitfield-Mask: 0xffff)                        */
/* ========================================================  TSCDRR  ========================================================= */

/* =========================================================================================================================== */
/* ================                                         R_UARTA0                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  TXBAn  ========================================================= */
/* =========================================================  RXBAn  ========================================================= */
/* ========================================================  ASIMAn0  ======================================================== */
 #define R_UARTA0_ASIMAn0_ISRMA_Pos    (0UL)    /*!< ISRMA (Bit 0)                                         */
 #define R_UARTA0_ASIMAn0_ISRMA_Msk    (0x1UL)  /*!< ISRMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_ISSMA_Pos    (1UL)    /*!< ISSMA (Bit 1)                                         */
 #define R_UARTA0_ASIMAn0_ISSMA_Msk    (0x2UL)  /*!< ISSMA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASIMAn0_RXEA_Pos     (5UL)    /*!< RXEA (Bit 5)                                          */
 #define R_UARTA0_ASIMAn0_RXEA_Msk     (0x20UL) /*!< RXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_TXEA_Pos     (6UL)    /*!< TXEA (Bit 6)                                          */
 #define R_UARTA0_ASIMAn0_TXEA_Msk     (0x40UL) /*!< TXEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASIMAn0_EN_Pos       (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA0_ASIMAn0_EN_Msk       (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */
/* ========================================================  ASIMAn1  ======================================================== */
 #define R_UARTA0_ASIMAn1_ALV_Pos      (0UL)    /*!< ALV (Bit 0)                                           */
 #define R_UARTA0_ASIMAn1_ALV_Msk      (0x1UL)  /*!< ALV (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_DIR_Pos      (1UL)    /*!< DIR (Bit 1)                                           */
 #define R_UARTA0_ASIMAn1_DIR_Msk      (0x2UL)  /*!< DIR (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASIMAn1_SL_Pos       (2UL)    /*!< SL (Bit 2)                                            */
 #define R_UARTA0_ASIMAn1_SL_Msk       (0x4UL)  /*!< SL (Bitfield-Mask: 0x01)                              */
 #define R_UARTA0_ASIMAn1_CL_Pos       (3UL)    /*!< CL (Bit 3)                                            */
 #define R_UARTA0_ASIMAn1_CL_Msk       (0x18UL) /*!< CL (Bitfield-Mask: 0x03)                              */
 #define R_UARTA0_ASIMAn1_PS_Pos       (5UL)    /*!< PS (Bit 5)                                            */
 #define R_UARTA0_ASIMAn1_PS_Msk       (0x60UL) /*!< PS (Bitfield-Mask: 0x03)                              */
/* ========================================================  BRGCAn  ========================================================= */
/* ========================================================  ASISAn  ========================================================= */
 #define R_UARTA0_ASISAn_OVEA_Pos      (0UL)    /*!< OVEA (Bit 0)                                          */
 #define R_UARTA0_ASISAn_OVEA_Msk      (0x1UL)  /*!< OVEA (Bitfield-Mask: 0x01)                            */
 #define R_UARTA0_ASISAn_FEA_Pos       (1UL)    /*!< FEA (Bit 1)                                           */
 #define R_UARTA0_ASISAn_FEA_Msk       (0x2UL)  /*!< FEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_PEA_Pos       (2UL)    /*!< PEA (Bit 2)                                           */
 #define R_UARTA0_ASISAn_PEA_Msk       (0x4UL)  /*!< PEA (Bitfield-Mask: 0x01)                             */
 #define R_UARTA0_ASISAn_TXSFA_Pos     (4UL)    /*!< TXSFA (Bit 4)                                         */
 #define R_UARTA0_ASISAn_TXSFA_Msk     (0x10UL) /*!< TXSFA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASISAn_TXBFA_Pos     (5UL)    /*!< TXBFA (Bit 5)                                         */
 #define R_UARTA0_ASISAn_TXBFA_Msk     (0x20UL) /*!< TXBFA (Bitfield-Mask: 0x01)                           */
/* ========================================================  ASCTAn  ========================================================= */
 #define R_UARTA0_ASCTAn_OVECTA_Pos    (0UL)    /*!< OVECTA (Bit 0)                                        */
 #define R_UARTA0_ASCTAn_OVECTA_Msk    (0x1UL)  /*!< OVECTA (Bitfield-Mask: 0x01)                          */
 #define R_UARTA0_ASCTAn_FECTA_Pos     (1UL)    /*!< FECTA (Bit 1)                                         */
 #define R_UARTA0_ASCTAn_FECTA_Msk     (0x2UL)  /*!< FECTA (Bitfield-Mask: 0x01)                           */
 #define R_UARTA0_ASCTAn_PECTA_Pos     (2UL)    /*!< PECTA (Bit 2)                                         */
 #define R_UARTA0_ASCTAn_PECTA_Msk     (0x4UL)  /*!< PECTA (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                        R_UARTA_CK                                         ================ */
/* =========================================================================================================================== */

/* ========================================================  UTAnCK  ========================================================= */
 #define R_UARTA_CK_UTAnCK_CK_Pos     (0UL)    /*!< CK (Bit 0)                                            */
 #define R_UARTA_CK_UTAnCK_CK_Msk     (0xfUL)  /*!< CK (Bitfield-Mask: 0x0f)                              */
 #define R_UARTA_CK_UTAnCK_SEL_Pos    (4UL)    /*!< SEL (Bit 4)                                           */
 #define R_UARTA_CK_UTAnCK_SEL_Msk    (0x30UL) /*!< SEL (Bitfield-Mask: 0x03)                             */
 #define R_UARTA_CK_UTAnCK_EN_Pos     (7UL)    /*!< EN (Bit 7)                                            */
 #define R_UARTA_CK_UTAnCK_EN_Msk     (0x80UL) /*!< EN (Bitfield-Mask: 0x01)                              */

/* =========================================================================================================================== */
/* ================                                           R_WDT                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  WDTRR  ========================================================= */
 #define R_WDT_WDTRR_WDTRR_Pos        (0UL)      /*!< WDTRR (Bit 0)                                         */
 #define R_WDT_WDTRR_WDTRR_Msk        (0xffUL)   /*!< WDTRR (Bitfield-Mask: 0xff)                           */
/* =========================================================  WDTCR  ========================================================= */
 #define R_WDT_WDTCR_RPSS_Pos         (12UL)     /*!< RPSS (Bit 12)                                         */
 #define R_WDT_WDTCR_RPSS_Msk         (0x3000UL) /*!< RPSS (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_RPES_Pos         (8UL)      /*!< RPES (Bit 8)                                          */
 #define R_WDT_WDTCR_RPES_Msk         (0x300UL)  /*!< RPES (Bitfield-Mask: 0x03)                            */
 #define R_WDT_WDTCR_CKS_Pos          (4UL)      /*!< CKS (Bit 4)                                           */
 #define R_WDT_WDTCR_CKS_Msk          (0xf0UL)   /*!< CKS (Bitfield-Mask: 0x0f)                             */
 #define R_WDT_WDTCR_TOPS_Pos         (0UL)      /*!< TOPS (Bit 0)                                          */
 #define R_WDT_WDTCR_TOPS_Msk         (0x3UL)    /*!< TOPS (Bitfield-Mask: 0x03)                            */
/* =========================================================  WDTSR  ========================================================= */
 #define R_WDT_WDTSR_REFEF_Pos        (15UL)     /*!< REFEF (Bit 15)                                        */
 #define R_WDT_WDTSR_REFEF_Msk        (0x8000UL) /*!< REFEF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_UNDFF_Pos        (14UL)     /*!< UNDFF (Bit 14)                                        */
 #define R_WDT_WDTSR_UNDFF_Msk        (0x4000UL) /*!< UNDFF (Bitfield-Mask: 0x01)                           */
 #define R_WDT_WDTSR_CNTVAL_Pos       (0UL)      /*!< CNTVAL (Bit 0)                                        */
 #define R_WDT_WDTSR_CNTVAL_Msk       (0x3fffUL) /*!< CNTVAL (Bitfield-Mask: 0x3fff)                        */
/* ========================================================  WDTRCR  ========================================================= */
 #define R_WDT_WDTRCR_RSTIRQS_Pos     (7UL)      /*!< RSTIRQS (Bit 7)                                       */
 #define R_WDT_WDTRCR_RSTIRQS_Msk     (0x80UL)   /*!< RSTIRQS (Bitfield-Mask: 0x01)                         */
/* =======================================================  WDTCSTPR  ======================================================== */
 #define R_WDT_WDTCSTPR_SLCSTP_Pos    (7UL)      /*!< SLCSTP (Bit 7)                                        */
 #define R_WDT_WDTCSTPR_SLCSTP_Msk    (0x80UL)   /*!< SLCSTP (Bitfield-Mask: 0x01)                          */

/* =========================================================================================================================== */
/* ================                                           R_TZF                                           ================ */
/* =========================================================================================================================== */

